"""
Задание 1.
Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
"""

name = input("Введите ваше имя: ")
age = input("Введите ваш возраст: ")
password = input("Введите ваш пароль: ")

print(f"Ваши данные для входа в аккаунт: "
      f"имя - {name}, "
      f"пароль - {password}, "
      f"возраст - {age}")